In [1]:
import pandas as pd
import numpy as np

In [7]:
df = pd.DataFrame({
    'one': pd.Series(np.random.randn(3), index=['a','b','c']),
    'two': pd.Series(np.random.randn(4), index=['a','b','c','d']),
    'three': pd.Series(np.random.randn(3), index=['b','c','d'])
})

df2 = df.copy()

In [8]:
df

        one       two     three
a  0.348437  1.808442       NaN
b  0.473410  0.669773  0.493715
c  0.389474 -1.088518 -0.228836
d       NaN -0.430255 -0.678458

In [9]:
# greater than
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [10]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [11]:
(df>0).all()

one      False
two      False
three    False
dtype: bool

In [12]:
(df>0).any()

one      True
two      True
three    True
dtype: bool

In [13]:
(df>0).any().any()

True

In [14]:
pd.Series([True]).bool()

True

In [15]:
pd.Series([False]).bool()

False

In [16]:
pd.DataFrame([[True]]).bool()

True

In [17]:
pd.Series(['foo','bar','baz'])=='foo'

0     True
1    False
2    False
dtype: bool

In [18]:
pd.Series(['foo','bar','baz']) == pd.Index(['foo','bar','qux'])

0     True
1     True
2    False
dtype: bool

In [19]:
(df + df == 2*df).all().all()

False

In [20]:
(df+df == 2*df)

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True

In [21]:
(df+df==2*df).all()

one      False
two       True
three    False
dtype: bool

In [22]:
# get False above where there is NaN
(df+df).equals(df*2)

True

In [23]:
# Aggregation for each column
df.mean(0)

one      0.403774
two      0.239860
three   -0.137860
dtype: float64

In [24]:
# Aggregation for each index
df.mean(1)

a    1.078439
b    0.545633
c   -0.309293
d   -0.554357
dtype: float64

In [25]:
ts_stand = (df-df.mean())/df.std()
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [26]:
series = pd.Series(np.random.randn(1000))
series[::2] = np.nan
series.describe()

count    500.000000
mean      -0.034321
std        0.965690
min       -2.859680
25%       -0.680589
50%       -0.066679
75%        0.650324
max        2.709809
dtype: float64

In [27]:
frame = pd.DataFrame(np.random.randn(1000,5), columns=['a','b','c','d','e'])
frame.iloc[::2] = np.nan
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.086785   -0.014947   -0.032376   -0.016173   -0.026270
std      0.982338    1.067750    0.964762    0.980531    0.984699
min     -2.298637   -3.453445   -3.070969   -3.108460   -2.798819
25%     -0.539801   -0.767261   -0.613127   -0.656457   -0.728228
50%      0.091217    0.039174   -0.036600   -0.029816   -0.012251
75%      0.734088    0.691894    0.618255    0.686955    0.612642
max      2.813805    3.786839    2.445391    2.559484    2.510127

In [28]:
s = pd.Series(['a','a','b','b','a','a',np.nan,'c','d','a'])
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [29]:
s1 = pd.Series(np.random.randn(5))
s1

0   -1.177918
1    0.016701
2   -0.550175
3   -1.514093
4    0.214694
dtype: float64

In [30]:
s1.idxmin(), s1.idxmax()

(3, 4)

In [31]:
df1 = pd.DataFrame(np.random.randn(5,3),columns=['A','B','C'])
df1

          A         B         C
0 -0.575516  0.137176 -0.600555
1  0.261161 -0.156255  1.240750
2 -0.762730 -1.206283 -0.911603
3  0.870644 -0.404736 -1.961060
4  0.568795 -0.159331 -0.670028

In [32]:
df1.idxmin(axis=0)

A    2
B    2
C    3
dtype: int64

In [35]:
df = pd.DataFrame({
    'col1':np.random.randn(3),
    'col2':np.random.randn(3)},
    index=['a','b','c'])

for col in df:
    print(col)

col1
col2

In [36]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})
for label, ser in df.items():
    print(label)
    print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [37]:
for row_index,row in df.iterrows():
    print(row_index,row,sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [38]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')

In [39]:
df

   a  b
0  1  a
1  2  b
2  3  c